{
    "experiences": [
        {
            "title": "Team Manager, Customer Experience",
            "company": "Alorica",
            "duration": "February 2022 - April 2023",
            "location": "Tucson, AZ",
            "bullets": [
                "Boosted agent productivity by crafting plans from behavioral analytics, leading to improved efficiency.",
                "Elevated team quality by 10% through custom software-focused training programs, optimizing support skills.",
                "Reduced handle time by a minute and follow-up rate by 25% by implementing data-driven process improvements.",
                "Led IT collaboration and coaching, improving agent technical skills and overall productivity by 5%."
            ]
        },
        {
            "title": "Project Manager, Game Development Intern",
            "company": "University of Arizona",
            "duration": "April 2022 - August 2022",
            "location": "Tucson, AZ",
            "bullets": [
                "Directed TechDuel.io, a 2D platformer game using Agile/Scrum, resulting in a successful game prototype.",
                "Orchestrated cross-functional team efforts securing milestone completions and improving overall team performance.",
                "Implemented real-time playability in TechDuel.io using WebSockets, boosting user interaction and engagement.",
                "Managed project timelines and budgets using Jira, delivering the project successfully within allocated resources."
            ]
        },
        {
            "title": "Information Technology Support Specialist",
            "company": "University of Arizona",
            "duration": "January 2015 - March 2020",
            "location": "Tucson, AZ",
            "bullets": [
                "Provided top-tier in-person and phone support to university affiliates enhancing user experience and service quality.",
                "Conducted comprehensive computer and software evaluations, rapidly identifying and diagnosing technical issues.",
                "Tackled and resolved complex technical challenges, improving affiliate's effective use of key technologies.",
                "Boosted customer satisfaction through detailed documentation and proactive follow-up, ensuring resolution efficacy."
            ]
        }
    ]
}