{
    "projects": [
        {
            "title": "Real-Time AI Twitch Streamer",
            "technologies": "AI/ML, Twitch API, Unreal Engine 5.3, MetaHuman, Oculus, C++, Python",
            "bullets": [
                "Developed AI-driven Twitch streamer using a text AI/ML model and Twitch API for live chat interaction.",
                "Created realistic MetaHuman model in Unreal Engine 5.3, enhancing virtual streaming engagement.",
                "Implemented custom-trained TTS model, syncing AI responses with MetaHuman speech via Oculus Lipsync.",
                "Applied Test-Driven Development for a robust, 24/7 operational AI streamer, capable of continuous learning."
            ]
        },
        {
            "title": "HaydenPrice.com",
            "url": "http://www.haydenprice.com",
            "technologies": "React, AWS, Apache, Docker, TypeScript, Stripe API",
            "bullets": [
                "Developed a responsive portfolio and e-commerce site, enhancing user experience with advanced web technologies.",
                "Used TypeScript for dynamic content in about me and project sections, sourcing data from JSON and markdown.",
                "Integrated Stripe API for e-commerce transactions, enhancing commercial functionality and payment experience.",
                "Containerized application using Docker, promoting consistent deployment across platforms and environments.",
                "Deployed on AWS EC2 with Apache, achieving robust, scalable hosting and optimized website performance."
            ]
        },
        {
            "title": "TechDuel.io",
            "url": "https://github.com/Norged-Out/Tech-Core-Game-2022",
            "technologies": "Unity, C#, WebGL, Jira, Websocket",
            "bullets": [
                "Managed 2D platformer shooter game project using Agile and Jira for team coordination and deadline adherence.",
                "Participated in a 5-member team, employing Agile/Scrum for weekly sprint reviews, enhancing project efficiency.",
                "Enabled real-time, in-browser gameplay with WebSockets, boosting player interaction and game dynamics.",
                "Ensured successful collaboration with developers to achieve project milestones and maintain high quality standards."
            ]
        }
    ]
}